package org.Nablus.eservices.Activities

import android.support.v7.app.AppCompatActivity
import android.os.Bundle
import kotlinx.android.synthetic.main.activity_news_details.*

import org.Nablus.eservices.R

class NewsDetailsActivity : AppCompatActivity() {

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_news_details)


        tvNewsTitle.text = " مشاركة بلدية نابلس في ورشة عمل المدن المنيعة"
        tvNewsText.text =
            "شاركت بلدية نابلس ممثلة بمديرة وحدة التخطيط الاستراتيجي والتنمية الاقتصادية د.آمال هدهد في ورشة عمل المدن المنيعة تحت عنوان \" تبادل الخبرات \" والتي عقدت في مدينة انشون في دولة كوريا الجنوبية في الفترة ما بين 4-8/3/2019 والتي نظمها مكتب الامم المتحدة للحد من مخاطر الكوارث ، حيث ان مدينة نابلس متمثلة ببلديتها ضمن عشرين مدينة حول العالم تم اختيارها لتحضير خطة تنفيذية للحد من مخاطر الكوارث .\n" +
    "\n" +
    "هدفت الورشة الى تبادل الخبرات بين المدن ومناقشة الدروس والعبر التي خرجت بها خطط الحد من الكوارث ، حيث قامت د.هدهد بتقديم عرض عن خطة التنفيذ التي تم اعدادها للحد من الكوارث في مدينة نابلس والتي تم اعدادها بالطريقة التشاركية مع كافة الاطراف ذات العلاقة في المدينة وباشراف جامعة النجاح الوطنية ( مركزالتخطيط الحضري والحد من الكوارث ) برئاسة د.جلال الدبيك ، ووضحت المراحل التي مرت بها اعداد الخطة والتي بدأت بشهر تموز 2018 ، والتي تضمنت ورش عمل متخصصة ، كما تم خلال الورشة تعبئة بطاقة قياس المناعة للمدينة والقدرة على الصمود وتحديد الفجوات والخروج بمشاريع وانشطة تمثلت بالعمل على القوانين والتشريعات وبناء قاعدة بيانات خاصة بالكوارث واعداد خرائط المخاطر وتطوير البنية التحتية وانظمة الانذار المبكر لمواجهة الكوارث وتمكين المدينة على الصمود ."


    }
}
